<a href="https://colab.research.google.com/github/King-Bowie/pandas-testando-e-analisando/blob/main/Pandas_Extras_testando_e_analisando.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandas: Testando e analisando

<h3>Neste data base fomos contratados por uma empresa da área de imóveis, e no momento temos um DataFrame que será analisado e explorado para um relatório para o nosso chefe.

<h5>Este conteúdo é baseado no curso da Alura com o mesmo nome.
<h5>Os dados foram distribuídos pela Alura através do curso com o mesmo nome.

para desfrutar do melhor funcionamento do notebook é recomendado o upload do arquivo <a href=https://github.com/King-Bowie/pandas-testando-e-analisando/blob/main/dados/aluguel.xlsx> aluguel.xlsx </a>  para o armazenamento da sessão presente em meu <a href=https://github.com/King-Bowie >GitHub <a/>

In [ ]:
#pandas extras, nao vai aparecer no pandas testando e analisando mas é muito util
import pandas as pd
dados_json = pd.read_json('https://raw.githubusercontent.com/King-Bowie/pandas-testando-e-analisando/main/dados/aluguel.json')
dados_json

                      Tipo           Bairro  Quartos  ...  Valor  Condominio    IPTU
0                Quitinete       Copacabana        1  ...   1700       500.0    60.0
1                     Casa  Jardim Botânico        2  ...   7000         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca        0  ...   5200      4020.0  1111.0
3              Apartamento           Centro        1  ...    800       390.0    20.0
4              Apartamento     Higienópolis        1  ...    800       230.0     NaN
5              Apartamento     Vista Alegre        3  ...   1200         NaN     NaN
6              Apartamento         Cachambi        2  ...   1300       301.0    17.0
7       Casa de Condomínio  Barra da Tijuca        5  ...  22000         NaN     NaN
8       Casa de Condomínio            Ramos        2  ...   1000         NaN     NaN
9  Conjunto Comercial/Sala           Centro        0  ...  35000     19193.0  3030.0

[10 rows x 9 columns]

In [ ]:
txt = pd.read_table('https://raw.githubusercontent.com/King-Bowie/pandas-testando-e-analisando/main/dados/aluguel.txt')
txt

                      Tipo           Bairro  Quartos  ...  Valor  Condominio    IPTU
0                Quitinete       Copacabana        1  ...   1700       500.0    60.0
1                     Casa  Jardim Botânico        2  ...   7000         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca        0  ...   5200      4020.0  1111.0
3              Apartamento           Centro        1  ...    800       390.0    20.0
4              Apartamento     Higienópolis        1  ...    800       230.0     NaN
5              Apartamento     Vista Alegre        3  ...   1200         NaN     NaN
6              Apartamento         Cachambi        2  ...   1300       301.0    17.0
7       Casa de Condomínio  Barra da Tijuca        5  ...  22000         NaN     NaN
8       Casa de Condomínio            Ramos        2  ...   1000         NaN     NaN
9  Conjunto Comercial/Sala           Centro        0  ...  35000     19193.0  3030.0

[10 rows x 9 columns]

In [ ]:
excel = pd.read_excel('aluguel.xlsx')
excel

                      Tipo           Bairro  Quartos  ...  Valor  Condominio    IPTU
0                Quitinete       Copacabana        1  ...   1700       500.0    60.0
1                     Casa  Jardim Botânico        2  ...   7000         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca        0  ...   5200      4020.0  1111.0
3              Apartamento           Centro        1  ...    800       390.0    20.0
4              Apartamento     Higienópolis        1  ...    800       230.0     NaN
5              Apartamento     Vista Alegre        3  ...   1200         NaN     NaN
6              Apartamento         Cachambi        2  ...   1300       301.0    17.0
7       Casa de Condomínio  Barra da Tijuca        5  ...  22000         NaN     NaN
8       Casa de Condomínio            Ramos        2  ...   1000         NaN     NaN
9  Conjunto Comercial/Sala           Centro        0  ...  35000     19193.0  3030.0

[10 rows x 9 columns]

In [ ]:
html1 = pd.read_html('https://raw.githubusercontent.com/King-Bowie/pandas-testando-e-analisando/main/dados/dados_html_1.html')
html1[0]

  FAIXA ETÁRIA UNAFISCO SAÚDE SOFT II SOFT PARTICIPATIVO      UNIQUE
0      00 A 18               R$218,99           R$192,60    R$334,48
1      19 A 23               R$263,63           R$207,67    R$380,06
2      24 A 28               R$322,44           R$224,26    R$464,39
3      29 A 33               R$402,05           R$258,63    R$566,68
4      34 A 38               R$455,17           R$306,37    R$664,61
5      39 A 43               R$489,29           R$417,93    R$742,72
6      44 A 48               R$582,65           R$495,24    R$869,47
7      49 A 53               R$718,86           R$562,64  R$1.046,29
8      54 A 58               R$908,54           R$721,00  R$1.355,74
9   59 OU MAIS             R$1.244,50         R$1.151,62  R$2.003,53

In [ ]:
len(html1) #significa que esta pagina possui apenas uma lista

1

In [ ]:
html2 = pd.read_html('https://raw.githubusercontent.com/King-Bowie/pandas-testando-e-analisando/main/dados/dados_html_2.html')

In [ ]:
len(html2) #está dizendo que esta pagina possui na verdade 3 listas

3

In [ ]:
primeira=html2[0]

In [ ]:
primeira.head()

        Date  ...                                       Reserve balances maintained 4
        Date  ... Balances maintained that exceed the top of the penalty- free band 6
0    Month 7  ...                                            Month 7
1  Apr. 2017  ...                                            2157202
2   May 2017  ...                                            2099222
3  June 2017  ...                                            2076852
4  July 2017  ...                                            2101027

[5 rows x 7 columns]

In [ ]:
html2[1]

                  Date  ...           Monetary base
                  Date  ... Currency in circulation
0              Month 7  ...                 Month 7
1            Apr. 2017  ...                 1540277
2             May 2017  ...                 1548643
3            June 2017  ...                 1556234
4            July 2017  ...                 1562107
5            Aug. 2017  ...                 1566007
6           Sept. 2017  ...                 1578756
7            Oct. 2017  ...                 1584208
8            Nov. 2017  ...                 1593280
9            Dec. 2017  ...                 1606695
10           Jan. 2018  ...                 1610195
11           Feb. 2018  ...                 1616316
12           Mar. 2018  ...                 1633651
13           Apr. 2018  ...                 1640991
14                 NaN  ...                     NaN
15  Two weeks ending 8  ...      Two weeks ending 8
16       Mar. 14, 2018  ...                 1631428
17       Mar. 28, 2018  ...                 1634753
18       Apr. 11, 2018  ...                 1638884
19       Apr. 25, 2018  ...                 1641137
20         May 9, 2018  ...                 1645219

[21 rows x 9 columns]

In [ ]:
html2[2]

                  Date  ... Nonborrowed reserves 1
                  Date  ... Nonborrowed reserves 1
0              Month 2  ...                Month 2
1            Apr. 2017  ...                2344767
2             May 2017  ...                2288880
3            June 2017  ...                2269588
4            July 2017  ...                2296763
5            Aug. 2017  ...                2406953
6           Sept. 2017  ...                2357651
7            Oct. 2017  ...                2310751
8            Nov. 2017  ...                2378217
9            Dec. 2017  ...                2309747
10           Jan. 2018  ...                2280960
11           Feb. 2018  ...                2305236
12           Mar. 2018  ...                2230859
13           Apr. 2018  ...                2150996
14                 NaN  ...                    NaN
15  Two weeks ending 3  ...     Two weeks ending 3
16       Mar. 14, 2018  ...                2290422
17       Mar. 28, 2018  ...                2184197
18       Apr. 11, 2018  ...                2170661
19       Apr. 25, 2018  ...                2162585
20         May 9, 2018  ...                2075288

[21 rows x 7 columns]

###Criando um dataframe

####Series

In [ ]:
data = [1,2,3,4,5]

In [ ]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
index = ['Linha' + str(i) for i in range(5) ]
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [ ]:
s = pd.Series(data, index= index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [ ]:
data = {'Linha' + str(i) : i+1 for i in range(5)}
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [ ]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [ ]:
s1 = s + 1
s1

Linha0    2
Linha1    3
Linha2    4
Linha3    5
Linha4    6
dtype: int64

In [ ]:
s2 = s + s1
s2

Linha0     3
Linha1     5
Linha2     7
Linha3     9
Linha4    11
dtype: int64

####Concatenação de DataFrame

In [ ]:
data = [[1,2,3],[4,5,6],
        [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [ ]:
df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
index = ['linha' + str(i) for i in range(3)]

In [ ]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
linha0  1  2  3
linha1  4  5  6
linha2  7  8  9

In [ ]:
colunas = ['coluna' + str(i) for i in range(3)]

In [ ]:
df1 = pd.DataFrame(data = data, index = index, columns = colunas)

In [ ]:
df1

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [ ]:
data_dicionario = {'coluna0': {'linha0': 1,'linha1':4,'linha2': 8},
                   'coluna1':{'linha0':20,'linha1':40,'linha2':80},
                   'coluna2':{'linha0':40,'linha1': 80,'linha2':120}}

In [ ]:
df2 = pd.DataFrame(data_dicionario)
df2

        coluna0  coluna1  coluna2
linha0        1       20       40
linha1        4       40       80
linha2        8       80      120

In [ ]:
data_tupla = [(1,2,3),(4,5,6),
              (7,8,9)]
data_tupla

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [ ]:
df3 = pd.DataFrame(data_tupla,index,colunas)
df3

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [ ]:
df4 = pd.concat([df1,df2,df3])
df4

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9
linha0        1       20       40
linha1        4       40       80
linha2        8       80      120
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [ ]:
df4 = pd.concat([df1,df2,df3], axis = 1)
df4

        coluna0  coluna1  coluna2  coluna0  ...  coluna2  coluna0  coluna1  coluna2
linha0        1        2        3        1  ...       40        1        2        3
linha1        4        5        6        4  ...       80        4        5        6
linha2        7        8        9        8  ...      120        7        8        9

[3 rows x 9 columns]

In [ ]:
numeros = [i for i in range(11)]
letras = [chr(i + 65) for i in range(11)]
nome_coluna = ['N']

df = pd.DataFrame(data = numeros, index = letras, columns = nome_coluna)
selecao = df['N'].isin([i for i in range(11) if i % 2 == 0])
df = df[selecao]
df

    N
A   0
C   2
E   4
G   6
I   8
K  10

In [ ]:
letras

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K']

In [ ]:
letras = [chr(i ) for i in range(1100)]
print(letras)

['\x00', '\x01', '\x02', '\x03', '\x04', '\x05', '\x06', '\x07', '\x08', '\t', '\n', '\x0b', '\x0c', '\r', '\x0e', '\x0f', '\x10', '\x11', '\x12', '\x13', '\x14', '\x15', '\x16', '\x17', '\x18', '\x19', '\x1a', '\x1b', '\x1c', '\x1d', '\x1e', '\x1f', ' ', '!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', '/', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', ':', ';', '<', '=', '>', '?', '@', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', '[', '\\', ']', '^', '_', '`', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', '{', '|', '}', '~', '\x7f', '\x80', '\x81', '\x82', '\x83', '\x84', '\x85', '\x86', '\x87', '\x88', '\x89', '\x8a', '\x8b', '\x8c', '\x8d', '\x8e', '\x8f', '\x90', '\x91', '\x92', '\x93', '\x94', '\x95', '\x96', '\x97', '\x98', '\x99', '\x9a', '\x9b', '\x9c', '\x9d', '\x9e', '\x9f', '\xa0', '¡', '¢', '£', '¤', '¥', '¦', '§', '¨', '©', 'ª', '«', '¬', '\xad', '®', '¯', '°', '±', '²', '³', '´', 'µ', '¶', '·', '¸', '¹', 'º', '»', '¼', '½', '¾', '¿', 'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ç', 'È', 'É', 'Ê', 'Ë', 'Ì', 'Í', 'Î', 'Ï', 'Ð', 'Ñ', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', '×', 'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'Ý', 'Þ', 'ß', 'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç', 'è', 'é', 'ê', 'ë', 'ì', 'í', 'î', 'ï', 'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷', 'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', 'ÿ', 'Ā', 'ā', 'Ă', 'ă', 'Ą', 'ą', 'Ć', 'ć', 'Ĉ', 'ĉ', 'Ċ', 'ċ', 'Č', 'č', 'Ď', 'ď', 'Đ', 'đ', 'Ē', 'ē', 'Ĕ', 'ĕ', 'Ė', 'ė', 'Ę', 'ę', 'Ě', 'ě', 'Ĝ', 'ĝ', 'Ğ', 'ğ', 'Ġ', 'ġ', 'Ģ', 'ģ', 'Ĥ', 'ĥ', 'Ħ', 'ħ', 'Ĩ', 'ĩ', 'Ī', 'ī', 'Ĭ', 'ĭ', 'Į', 'į', 'İ', 'ı', 'Ĳ', 'ĳ', 'Ĵ', 'ĵ', 'Ķ', 'ķ', 'ĸ', 'Ĺ', 'ĺ', 'Ļ', 'ļ', 'Ľ', 'ľ', 'Ŀ', 'ŀ', 'Ł', 'ł', 'Ń', 'ń', 'Ņ', 'ņ', 'Ň', 'ň', 'ŉ', 'Ŋ', 'ŋ', 'Ō', 'ō', 'Ŏ', 'ŏ', 'Ő', 'ő', 'Œ', 'œ', 'Ŕ', 'ŕ', 'Ŗ', 'ŗ', 'Ř', 'ř', 'Ś', 'ś', 'Ŝ', 'ŝ', 'Ş', 'ş', 'Š', 'š', 'Ţ', 'ţ', 'Ť', 'ť', 'Ŧ', 'ŧ', 'Ũ', 'ũ', 'Ū', 'ū', 'Ŭ', 'ŭ', 'Ů', 'ů', 'Ű', 'ű', 'Ų', 'ų', 'Ŵ', 'ŵ', 'Ŷ', 'ŷ', 'Ÿ', 'Ź', 'ź', 'Ż', 'ż', 'Ž', 'ž', 'ſ', 'ƀ', 'Ɓ', 'Ƃ', 'ƃ', 'Ƅ', 'ƅ', 'Ɔ', 'Ƈ', 'ƈ', 'Ɖ', 'Ɗ', 'Ƌ', 'ƌ', 'ƍ', 'Ǝ', 'Ə', 'Ɛ', 'Ƒ', 'ƒ', 'Ɠ', 'Ɣ', 'ƕ', 'Ɩ', 'Ɨ', 'Ƙ', 'ƙ', 'ƚ', 'ƛ', 'Ɯ', 'Ɲ', 'ƞ', 'Ɵ', 'Ơ', 'ơ', 'Ƣ', 'ƣ', 'Ƥ', 'ƥ', 'Ʀ', 'Ƨ', 'ƨ', 'Ʃ', 'ƪ', 'ƫ', 'Ƭ', 'ƭ', 'Ʈ', 'Ư', 'ư', 'Ʊ', 'Ʋ', 'Ƴ', 'ƴ', 'Ƶ', 'ƶ', 'Ʒ', 'Ƹ', 'ƹ', 'ƺ', 'ƻ', 'Ƽ', 'ƽ', 'ƾ', 'ƿ', 'ǀ', 'ǁ', 'ǂ', 'ǃ', 'Ǆ', 'ǅ', 'ǆ', 'Ǉ', 'ǈ', 'ǉ', 'Ǌ', 'ǋ', 'ǌ', 'Ǎ', 'ǎ', 'Ǐ', 'ǐ', 'Ǒ', 'ǒ', 'Ǔ', 'ǔ', 'Ǖ', 'ǖ', 'Ǘ', 'ǘ', 'Ǚ', 'ǚ', 'Ǜ', 'ǜ', 'ǝ', 'Ǟ', 'ǟ', 'Ǡ', 'ǡ', 'Ǣ', 'ǣ', 'Ǥ', 'ǥ', 'Ǧ', 'ǧ', 'Ǩ', 'ǩ', 'Ǫ', 'ǫ', 'Ǭ', 'ǭ', 'Ǯ', 'ǯ', 'ǰ', 'Ǳ', 'ǲ', 'ǳ', 'Ǵ', 'ǵ', 'Ƕ', 'Ƿ', 'Ǹ', 'ǹ', 'Ǻ', 'ǻ', 'Ǽ', 'ǽ', 'Ǿ', 'ǿ', 'Ȁ', 'ȁ', 'Ȃ', 'ȃ', 'Ȅ', 'ȅ', 'Ȇ', 'ȇ', 'Ȉ', 'ȉ', 'Ȋ', 'ȋ', 'Ȍ', 'ȍ', 'Ȏ', 'ȏ', 'Ȑ', 'ȑ', 'Ȓ', 'ȓ', 'Ȕ', 'ȕ', 'Ȗ', 'ȗ', 'Ș', 'ș', 'Ț', 'ț', 'Ȝ', 'ȝ', 'Ȟ', 'ȟ', 'Ƞ', 'ȡ', 'Ȣ', 'ȣ', 'Ȥ', 'ȥ', 'Ȧ', 'ȧ', 'Ȩ', 'ȩ', 'Ȫ', 'ȫ', 'Ȭ', 'ȭ', 'Ȯ', 'ȯ', 'Ȱ', 'ȱ', 'Ȳ', 'ȳ', 'ȴ', 'ȵ', 'ȶ', 'ȷ', 'ȸ', 'ȹ', 'Ⱥ', 'Ȼ', 'ȼ', 'Ƚ', 'Ⱦ', 'ȿ', 'ɀ', 'Ɂ', 'ɂ', 'Ƀ', 'Ʉ', 'Ʌ', 'Ɇ', 'ɇ', 'Ɉ', 'ɉ', 'Ɋ', 'ɋ', 'Ɍ', 'ɍ', 'Ɏ', 'ɏ', 'ɐ', 'ɑ', 'ɒ', 'ɓ', 'ɔ', 'ɕ', 'ɖ', 'ɗ', 'ɘ', 'ə', 'ɚ', 'ɛ', 'ɜ', 'ɝ', 'ɞ', 'ɟ', 'ɠ', 'ɡ', 'ɢ', 'ɣ', 'ɤ', 'ɥ', 'ɦ', 'ɧ', 'ɨ', 'ɩ', 'ɪ', 'ɫ', 'ɬ', 'ɭ', 'ɮ', 'ɯ', 'ɰ', 'ɱ', 'ɲ', 'ɳ', 'ɴ', 'ɵ', 'ɶ', 'ɷ', 'ɸ', 'ɹ', 'ɺ', 'ɻ', 'ɼ', 'ɽ', 'ɾ', 'ɿ', 'ʀ', 'ʁ', 'ʂ', 'ʃ', 'ʄ', 'ʅ', 'ʆ', 'ʇ', 'ʈ', 'ʉ', 'ʊ', 'ʋ', 'ʌ', 'ʍ', 'ʎ', 'ʏ', 'ʐ', 'ʑ', 'ʒ', 'ʓ', 'ʔ', 'ʕ', 'ʖ', 'ʗ', 'ʘ', 'ʙ', 'ʚ', 'ʛ', 'ʜ', 'ʝ', 'ʞ', 'ʟ', 'ʠ', 'ʡ', 'ʢ', 'ʣ', 'ʤ', 'ʥ', 'ʦ', 'ʧ', 'ʨ', 'ʩ', 'ʪ', 'ʫ', 'ʬ', 'ʭ', 'ʮ', 'ʯ', 'ʰ', 'ʱ', 'ʲ', 'ʳ', 'ʴ', 'ʵ', 'ʶ', 'ʷ', 'ʸ', 'ʹ', 'ʺ', 'ʻ', 'ʼ', 'ʽ', 'ʾ', 'ʿ', 'ˀ', 'ˁ', '˂', '˃', '˄', '˅', 'ˆ', 'ˇ', 'ˈ', 'ˉ', 'ˊ', 'ˋ', 'ˌ', 'ˍ', 'ˎ', 'ˏ', 'ː', 'ˑ', '˒', '˓', '˔', '˕', '˖', '˗', '˘', '˙', '˚', '˛', '˜', '˝', '˞', '˟', 'ˠ', 'ˡ', 'ˢ', 'ˣ', 'ˤ', '˥', '˦', '˧', '˨', '˩', '˪', '˫', 'ˬ', '˭', 'ˮ', '˯', '˰', '˱', '˲', '˳', '˴', '˵', '˶', '˷', '˸', '˹', '˺', '˻', '˼', '˽', '˾', '˿', '̀', '́', '̂', '̃', '̄', '̅', '̆', '̇', '̈', '̉', '̊', '̋', '̌', '̍', '̎', '̏', '̐', '̑', '̒', '̓', '̔', '̕', '̖', '̗', '̘', '̙', '̚', '̛', '̜', '̝', '̞', '̟', '̠', '̡', '̢', '̣', '̤', '̥', '̦', '̧', '̨', '̩', '̪', '̫', '̬', '̭', '̮', '̯', '̰', '̱', '̲', '̳', '̴', '̵', '̶', '̷', '̸', '̹', '̺', '̻', '̼', '̽', '̾', '̿', '̀', '́', '͂', '̓', '̈́', 'ͅ', '͆', '͇', '͈', '͉', '͊', '͋', '͌', '͍', '͎', '͏', '͐', '͑', '͒', '͓', '͔', '͕', '͖', '͗', '͘', '͙', '͚', '͛', '͜', '͝', '͞', '͟', '͠', '͡', '͢', 'ͣ', 'ͤ', 'ͥ', 'ͦ', 'ͧ', 'ͨ', 'ͩ', 'ͪ', 'ͫ', 'ͬ', 'ͭ', 'ͮ', 'ͯ', 'Ͱ', 'ͱ', 'Ͳ', 'ͳ', 'ʹ', '͵', 'Ͷ', 'ͷ', '\u0378', '\u0379', 'ͺ', 'ͻ', 'ͼ', 'ͽ', ';', 'Ϳ', '\u0380', '\u0381', '\u0382', '\u0383', '΄', '΅', 'Ά', '·', 'Έ', 'Ή', 'Ί', '\u038b', 'Ό', '\u038d', 'Ύ', 'Ώ', 'ΐ', 'Α', 'Β', 'Γ', 'Δ', 'Ε', 'Ζ', 'Η', 'Θ', 'Ι', 'Κ', 'Λ', 'Μ', 'Ν', 'Ξ', 'Ο', 'Π', 'Ρ', '\u03a2', 'Σ', 'Τ', 'Υ', 'Φ', 'Χ', 'Ψ', 'Ω', 'Ϊ', 'Ϋ', 'ά', 'έ', 'ή', 'ί', 'ΰ', 'α', 'β', 'γ', 'δ', 'ε', 'ζ', 'η', 'θ', 'ι', 'κ', 'λ', 'μ', 'ν', 'ξ', 'ο', 'π', 'ρ', 'ς', 'σ', 'τ', 'υ', 'φ', 'χ', 'ψ', 'ω', 'ϊ', 'ϋ', 'ό', 'ύ', 'ώ', 'Ϗ', 'ϐ', 'ϑ', 'ϒ', 'ϓ', 'ϔ', 'ϕ', 'ϖ', 'ϗ', 'Ϙ', 'ϙ', 'Ϛ', 'ϛ', 'Ϝ', 'ϝ', 'Ϟ', 'ϟ', 'Ϡ', 'ϡ', 'Ϣ', 'ϣ', 'Ϥ', 'ϥ', 'Ϧ', 'ϧ', 'Ϩ', 'ϩ', 'Ϫ', 'ϫ', 'Ϭ', 'ϭ', 'Ϯ', 'ϯ', 'ϰ', 'ϱ', 'ϲ', 'ϳ', 'ϴ', 'ϵ', '϶', 'Ϸ', 'ϸ', 'Ϲ', 'Ϻ', 'ϻ', 'ϼ', 'Ͻ', 'Ͼ', 'Ͽ', 'Ѐ', 'Ё', 'Ђ', 'Ѓ', 'Є', 'Ѕ', 'І', 'Ї', 'Ј', 'Љ', 'Њ', 'Ћ', 'Ќ', 'Ѝ', 'Ў', 'Џ', 'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я', 'а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы']

##Organizando DataFrames (Sort)

In [ ]:
data_sort = [[1,2,3],[4,5,6],
        [7,8,9]]
data_sort

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [ ]:
list('321')

['3', '2', '1']

In [ ]:
df_sort = pd.DataFrame(data_sort, index= list("321"), columns = list('ZYX')) 
df_sort

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [ ]:
df_sort.sort_index(inplace=True)
df_sort

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [ ]:
df_sort.sort_index(inplace=True,axis=1)
df_sort

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [ ]:
df_sort.sort_values(by = 'X',inplace=True)
df_sort

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [ ]:
df_sort.sort_values(by = '3', inplace=True, axis=1)
df_sort

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [ ]:
df_sort.sort_values(by = ['X','Y'],inplace=True)
df_sort

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [ ]:
df_sort.sort_index()

df_sort

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [ ]:
df_sort.sort_index(axis=1)

df_sort

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

##Formas de Seleção

In [ ]:
tupla_selecao = [(1,2,3,4),
                (5,6,7,8),
                (9,10,11,12),
                (13,14,15,16)]
df_tupla = pd.DataFrame(tupla_selecao, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())
df_tupla

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [ ]:
df_tupla['c1']

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [ ]:
df_tupla[['c3','c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

In [ ]:
df_tupla[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [ ]:
df_tupla[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [ ]:
df_tupla[1:][['c2','c1']]

    c2  c1
l2   6   5
l3  10   9
l4  14  13

In [ ]:
df_tupla

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [ ]:
df_tupla.loc[['l1','l3']]

    c1  c2  c3  c4
l1   1   2   3   4
l3   9  10  11  12

In [ ]:
df_tupla.loc['l1','c2']

2

In [ ]:
df_tupla.iloc[0,1]

2

In [ ]:
df_tupla.loc[['l3','l1'],['c4','c1']]

    c4  c1
l3  12   9
l1   4   1

In [ ]:
df_tupla

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [ ]:
df_tupla.iloc[[2,0],[3,0]]

    c4  c1
l3  12   9
l1   4   1

##Métodos de interpolação

In [ ]:
dados = [0.5, None, None, 0.22, 0.54, None, None, 7.32, 0.6, None, 0.1]
a = pd.Series(dados)
a

0     0.50
1      NaN
2      NaN
3     0.22
4     0.54
5      NaN
6      NaN
7     7.32
8     0.60
9      NaN
10    0.10
dtype: float64

In [ ]:
a.fillna(0)

0     0.50
1     0.00
2     0.00
3     0.22
4     0.54
5     0.00
6     0.00
7     7.32
8     0.60
9     0.00
10    0.10
dtype: float64

In [ ]:
a.fillna(method= 'ffill')

0     0.50
1     0.50
2     0.50
3     0.22
4     0.54
5     0.54
6     0.54
7     7.32
8     0.60
9     0.60
10    0.10
dtype: float64

In [ ]:
a.fillna(method= 'bfill')

0     0.50
1     0.22
2     0.22
3     0.22
4     0.54
5     7.32
6     7.32
7     7.32
8     0.60
9     0.10
10    0.10
dtype: float64

In [ ]:
a

0     0.50
1      NaN
2      NaN
3     0.22
4     0.54
5      NaN
6      NaN
7     7.32
8     0.60
9      NaN
10    0.10
dtype: float64

In [ ]:
a.fillna(s.mean())

0     0.50
1     3.00
2     3.00
3     0.22
4     0.54
5     3.00
6     3.00
7     7.32
8     0.60
9     3.00
10    0.10
dtype: float64

In [ ]:
a1 = a.fillna(method= 'ffill', limit = 1)
a1

0     0.50
1     0.50
2      NaN
3     0.22
4     0.54
5     0.54
6      NaN
7     7.32
8     0.60
9     0.60
10    0.10
dtype: float64

In [ ]:
 a1.fillna(method= 'bfill', limit = 1)

0     0.50
1     0.50
2     0.22
3     0.22
4     0.54
5     0.54
6     7.32
7     7.32
8     0.60
9     0.60
10    0.10
dtype: float64

##Contadores

In [ ]:
series = pd.Series(list('sadasdasdasd'))
series

0     s
1     a
2     d
3     a
4     s
5     d
6     a
7     s
8     d
9     a
10    s
11    d
dtype: object

In [ ]:
series.unique()

array(['s', 'a', 'd'], dtype=object)

In [ ]:
series.value_counts()

a    4
d    4
s    4
dtype: int64

In [ ]:
contadores = pd.read_csv('https://raw.githubusercontent.com/King-Bowie/pandas-testando-e-analisando/main/dados/aluguel.csv', sep =";")
contadores

                          Tipo                Bairro  ...  Condominio    IPTU
0                    Quitinete            Copacabana  ...       500.0    60.0
1                         Casa       Jardim Botânico  ...         NaN     NaN
2      Conjunto Comercial/Sala       Barra da Tijuca  ...      4020.0  1111.0
3                  Apartamento                Centro  ...       390.0    20.0
4                  Apartamento          Higienópolis  ...       230.0     NaN
...                        ...                   ...  ...         ...     ...
32955                Quitinete                Centro  ...       350.0    25.0
32956              Apartamento           Jacarepaguá  ...       800.0    40.0
32957              Apartamento  São Francisco Xavier  ...       509.0    37.0
32958              Apartamento                Leblon  ...       760.0     NaN
32959  Conjunto Comercial/Sala                Centro  ...      4206.0  1109.0

[32960 rows x 9 columns]

In [ ]:
contadores.Tipo.unique()

array(['Quitinete', 'Casa', 'Conjunto Comercial/Sala', 'Apartamento',
       'Casa de Condomínio', 'Prédio Inteiro', 'Flat', 'Loja/Salão',
       'Galpão/Depósito/Armazém', 'Casa Comercial', 'Casa de Vila',
       'Terreno Padrão', 'Box/Garagem', 'Loft',
       'Loja Shopping/ Ct Comercial', 'Chácara', 'Loteamento/Condomínio',
       'Sítio', 'Pousada/Chalé', 'Studio', 'Hotel', 'Indústria'],
      dtype=object)

In [ ]:
contadores.Tipo.value_counts()

Apartamento                    19532
Conjunto Comercial/Sala         6815
Loja/Salão                      1426
Casa de Condomínio               996
Casa                             967
Quitinete                        836
Galpão/Depósito/Armazém          623
Flat                             476
Prédio Inteiro                   301
Casa Comercial                   265
Casa de Vila                     249
Loja Shopping/ Ct Comercial      247
Box/Garagem                       82
Terreno Padrão                    70
Loft                              51
Sítio                             10
Loteamento/Condomínio              5
Studio                             4
Hotel                              2
Pousada/Chalé                      1
Indústria                          1
Chácara                            1
Name: Tipo, dtype: int64